In [1]:
import psycopg2

In [2]:
#pip install pandas

In [2]:
import pandas as pd

In [3]:

def create_database():
    # create connection to the database
    conn = psycopg2.connect("host=localhost dbname=details user=postgres password=emilia")
    conn.set_session(autocommit=True)
    cur = conn.cursor()

    # create sparkify database with UTF encoding
    #cur.execute("DROP DATABASE IF EXISTS new_db")
    #cur.execute("CREATE DATABASE new_db")

    # close the connection to the default database
    conn.close()

    # create a new connection to the new people database
    conn = psycopg2.connect("host=localhost dbname=new_db user=postgres password=emilia")
    cur = conn.cursor()

    return cur, conn

In [4]:
conn = psycopg2.connect("host=localhost dbname=new_db user=postgres password=emilia")
conn.set_session(autocommit=True)
cur = conn.cursor()

In [ ]:
def create_table():

In [17]:
account_details=pd.read_csv("Data/Account_Details_Data.csv")
account_details.head()

,id,country,postal_code,credit_card_type,credit_card_number
0,1,Indonesia,NaN,jcb,3.580000e+15
1,2,Argentina,8503,visa,4.620000e+15
2,3,Democratic Republic of the Congo,NaN,jcb,3.560000e+15
3,4,China,NaN,diners-club-us-ca,5.400000e+15
4,5,Libya,NaN,jcb,3.530000e+15

In [18]:
type(account_details)

pandas.core.frame.DataFrame

In [34]:
location_details=pd.read_csv("Data/Location_Details_Data.csv")
location_details.head()
#type(location_details)

        id   Country  Postal Code   Credit Card Type
0    Mazda       MPV         1998  JHMGE8G24AS283531
1      Kia    Sedona         2002  JTDKDTB36F1481381
2  Porsche  Panamera         2012  5J8TB18279A927590
3    Mazda       MPV         1992  1G6YV34A055158621
4   Subaru    Loyale         1992  5LMJJ3J54DE815655

In [5]:
Personal_Data=pd.read_csv("Data/Personal_Data_Table.csv")
Personal_Data.head()

,id,first_name,last_name,email,gender,ip_address
0,1,Donielle,Dunley,ddunley0@ovh.net,Female,19.229.197.180
1,2,Auberon,Rubinfajn,arubinfajn1@mayoclinic.com,Male,85.188.248.20
2,3,Sutherland,Ilyenko,silyenko2@nyu.edu,Male,117.191.198.79
3,4,Dollie,Tomasek,dtomasek3@nytimes.com,Female,107.31.142.234
4,5,Rosana,Andrea,randrea4@paypal.com,Female,38.187.232.11

In [11]:
cur, conn = create_database()
#conn.rollback()

In [7]:

account_details = """CREATE TABLE IF NOT EXISTS account_detail (
    id VARCHAR ,
    Country VARCHAR,
    postal_code VARCHAR,
    credit_card_type VARCHAR,
    credit_card_number VARCHAR
)"""

#conn.rollback()
#cur.execute(account_details)
#conn.commit()


#Personal_Data_table= ("""CREATE TABLE Personal_Data(id numeric,first_name VARCHAR, Last_name varcha, email varchar, gender VARCHAR, IP_address numeric)""")

In [12]:
try:
    # Execute the CREATE TABLE statement
    cur.execute(account_details)

    # Commit the transaction
    conn.commit()

except psycopg2.Error as e:
    # Handle the error
    print("Error:", e)

In [46]:
#conn.rollback()

In [15]:
location_details = """CREATE TABLE IF NOT EXISTS location_detail (
    id VARCHAR PRIMARY KEY,
    Country VARCHAR,
    postal_code VARCHAR,
    credit_card_type VARCHAR
)"""

In [16]:
try:
    # Execute the CREATE TABLE statement
    cur.execute(location_details)

    # Commit the transaction
    conn.commit()

except psycopg2.Error as e:
    # Handle the error
    print("Error:", e)

In [6]:
personal_details = """CREATE TABLE IF NOT EXISTS personal_details (
    id VARCHAR PRIMARY KEY,
    first_name VARCHAR,
    last_name VARCHAR,
    email VARCHAR,
    gender VARCHAR,
    ip_address VARCHAR
)"""

In [7]:
try:
    # Execute the CREATE TABLE statement
    cur.execute(personal_details)

    # Commit the transaction
    conn.commit()

except psycopg2.Error as e:
    # Handle the error
    print("Error:", e)

In [21]:
type(account_details)
account_details.count()

id                    1000
country               1000
postal_code            496
credit_card_type      1000
credit_card_number    1000
dtype: int64

In [13]:
account_details_insert = ("""INSERT INTO account_detail (
    id,
    Country,
    postal_code,
    credit_card_type,
    credit_card_number)
    VALUES(%s,%s,%s,%s,%s)
""")

In [35]:
for i, row in account_details.iterrows():
    cur.execute(account_details_insert, list(row))
conn.commit()

In [42]:
location_details_insert = ("""
    INSERT INTO  location_detail (
    id,
        Country,
        postal_code,
        credit_card_type)
        VALUES (%s, %s, %s, %s)
""")

In [13]:
for i, row in location_details.iterrows():
    cur.execute(location_details_insert, list(row))
connection.commit()

In [9]:
personal_details_insert = ("""
    INSERT INTO personal_details   (
     id,
    first_name,
    last_name,
    email,
    gender,
    ip_address    
    )
        VALUES (%s, %s, %s, %s,%s,%s)
""")

In [12]:
for i, row in Personal_Data.iterrows():
    cur.execute(personal_details_insert, list(row))
conn.commit()